blog/_posts/2013-10/2013-10-21-git-use.html
---
layout: post
keywords: 
description: 
title: github常用操作和常见错误
categories: [git]
tags: [git,proxy]
group: archive
icon: github
featured: false
---

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 常用操作</a>
<ul>
<li><a href="#sec-1-1">1.1 github使用http代理</a></li>
<li><a href="#sec-1-2">1.2 参考资料</a></li>
<li><a href="#sec-1-3">1.3 克隆仓库的单个分支</a></li>
</ul>
</li>
<li><a href="#sec-2">2 常见错误</a>
<ul>
<li><a href="#sec-2-1">2.1 error: RPC failed; result=55, HTTP code = 0</a></li>
<li><a href="#sec-2-2">2.2 解决办法</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 windows</a></li>
<li><a href="#sec-2-2-2">2.2.2 linux:</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">常用操作</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">github使用http代理</h3>
<div class="outline-text-3" id="text-1-1">

<p>今天使用git clone和push的时候竟然出现error:Failed connect to github.com:443的错误，没办法只能使用goagent了。
运行下面两条命令就ok了。
</p>


<pre class="example">git config http.proxy http://127.0.0.1:8087/
git config http.sslVerify false
</pre>

<p>
之后在push就可以了。
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">参考资料</h3>
<div class="outline-text-3" id="text-1-2">

<p><a href="http://cloudaice.com/use-git/">use git</a>
</p>
<p>
话说这人博客风格我挺喜欢，回头fork
</p></div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">克隆仓库的单个分支</h3>
<div class="outline-text-3" id="text-1-3">

<p>git clone -b &lt;branch&gt; &lt;remote<sub>repo&gt</sub>; 
</p></div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">常见错误</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">error: RPC failed; result=55, HTTP code = 0</h3>
<div class="outline-text-3" id="text-2-1">

<p>git push 提交的时候出现错误
</p>


<pre class="example">error: RPC failed; result=55, HTTP code = 0
fatal: The remote end hung up unexpectedly
fatal: The remote end hung up unexpectedly
</pre>

<p>
用http或者https方式提交git里大批量的数据更改时，可能会遇到这样的错误,这是因为Git默认设置最大的HTTP传输量为1MB。
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">解决办法</h3>
<div class="outline-text-3" id="text-2-2">

<p>修改可传输最大值
</p>
</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">windows</h4>
<div class="outline-text-4" id="text-2-2-1">

<p>在 .git/config 文件中加入
</p>


<pre class="example">[http]
postBuffer = 524288000
</pre>

</div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2">linux:</h4>
<div class="outline-text-4" id="text-2-2-2">




<pre class="example">git config http.postBuffer 524288000 
</pre>

</div>
</div>
</div>
</div>
